'''
Напишите программу, которая принимает на вход список чисел в одной строке и выводит на экран в одну строку значения, которые повторяются в нём более одного раза.

Для решения задачи может пригодиться метод sort списка.

Выводимые числа не должны повторяться, порядок их вывода может быть произвольным.
'''


def seach_match(a):
    list.sort(a)
    b = []
    i = 0
    while(i < len(a)):
        if (a.count(a[i]) > 1):
            b.append(a[i])
        i += a.count(a[i])
    return b            


a = [int(i) for i in input().split()]
b = seach_match(a)
for i in b:
    print(i, end = ' ')