'''Напишите программу, которая считывает со стандартного ввода целые числа, 
по одному числу в строке, и после первого введенного нуля выводит сумму полученных на вход чисел.'''


s = 1   #вводимое число
m = 0   #сумирует вводимые числа
while (s != 0):
    s = int(input())
    m = m + s
print(m)