'''
Когда Павел учился в школе, он запоминал таблицу умножения прямоугольными блоками. Для тренировок ему бы очень пригодилась программа, которая показывала бы блок таблицы умножения.

Напишите программу, на вход которой даются четыре числа a, b, c и d, каждое в своей строке. Программа должна вывести фрагмент таблицы умножения для всех чисел отрезка [a;b] на все числа отрезка [c;d].

Числа a, b, c и d являются натуральными и не превосходят 10, a≤b, c≤d.

Следуйте формату вывода из примера, для разделения элементов внутри строки используйте '\t' — символ табуляции. Заметьте, что левым столбцом и верхней строкой выводятся сами числа из заданных отрезков — заголовочные столбец и строка таблицы.
'''

a,b,c,d = (int(input()) for _ in range(4))  #генератор для считывания 

for i in range(a - 1,b + 1):
    if i < a:
        print(' ', end='\t')
    else:
        print(i, end='\t')
    for j in range(c,d + 1):
        if i < a:
            print(j, end='\t')
        else:
            print(i * j, end='\t')
    print()
