'''
Дан файл с таблицей в формате TSV с информацией о росте школьников разных классов.

Напишите программу, которая прочитает этот файл и подсчитает для каждого класса средний рост учащегося.

Файл состоит из набора строк, каждая из которых представляет собой три поля:
Класс Фамилия Рост

Класс обозначается только числом. Буквенные модификаторы не используются. Номер класса может быть от 1 до 11 включительно. В фамилии нет пробелов, а в качестве роста используется натуральное число, но при подсчёте среднего требуется вычислить значение в виде вещественного числа.

Выводить информацию о среднем росте следует в порядке возрастания номера класса (для классов с первого по одиннадцатый). Если про какой-то класс нет информации, необходимо вывести напротив него прочерк, например:
'''

with open('input.txt') as f:
    new_list = f.readlines()
for i in range(len(new_list)):
    new_list[i] = new_list[i].strip().split()
res = [['-'] for _ in range(1, 12)]
for i in range(len(new_list)):
    res[int(new_list[i][0]) - 1].append(new_list[i][2])
for i in range(len(res)):
    if len(res[i]) > 1:
        temp = 0
        count = 0
        for j in range(1, len(res[i])):
            temp += int(res[i][j])
            count += 1
        res[i] = []
        res[i] = [temp/count]
for i in range(len(res)):
    print(i+1, *res[i])
