'''
Простейшая система проверки орфографии основана на использовании списка известных слов. Каждое слово в проверяемом тексте ищется в этом списке и, если такое слово не найдено, оно помечается, как ошибочное.

Напишем подобную систему.

Через стандартный ввод подаётся следующая структура: первой строкой — количество d записей в списке известных слов, после передаётся  d строк с одним словарным словом на строку, затем — количество l строк текста, после чего — l строк текста.

Напишите программу, которая выводит слова из текста, которые не встречаются в словаре. Регистр слов не учитывается. Порядок вывода слов произвольный. Слова, не встречающиеся в словаре, не должны повторяться в выводе программы.
'''

import copy


d = int(input())
list_d = []
for i in range(d):
  list_d.append(input())
copy_d = []
for i in range(d):
  copy_d.append(list_d[i].lower())
l = int(input())
list_l = []
for i in range(l):
  list_l.append([j for j in input().split()])
list_res = []
f = []
for i in range(l):
  for j in range(len(list_l[i])):
    if list_l[i][j].lower() not in copy_d and list_l[i][j].lower() not in f:
      list_res.append(list_l[i][j])
      f.append(list_l[i][j].lower())
for i in list_res:
  print (i)