'''
Напишите программу, которая принимает на стандартный вход список игр футбольных команд с результатом матча и выводит на стандартный вывод сводную таблицу результатов всех матчей.

За победу команде начисляется 3 очка, за поражение — 0, за ничью — 1.

Формат ввода следующий:
В первой строке указано целое число \( n \) — количество завершенных игр.
После этого идет \( n \) строк, в которых записаны результаты игры в следующем формате:
Первая_команда;Забито_первой_командой;Вторая_команда;Забито_второй_командой

Вывод программы необходимо оформить следующим образом:
Команда:Всего_игр Побед Ничьих Поражений Всего_очков

Конкретный пример ввода-вывода приведён ниже.

Порядок вывода команд произвольный.
'''

n = int(input())
a = [[i for i in input().split(';')] for j in range(n)]
d = {}
for i in range(n):
    if a[i][0] not in d:
        d[a[i][0]] = [0,0,0,0,0]
    if a[i][2] not in d:
        d[a[i][2]] = [0,0,0,0,0]    
    if a[i][1] > a[i][3]:   #неплохо бы функцию написать, но я не буду)
        d[a[i][0]][0] += 1
        d[a[i][2]][0] += 1
        d[a[i][0]][1] += 1
        d[a[i][2]][3] += 1
        d[a[i][0]][4] += 3
    elif a[i][3] > a[i][1]:   #неплохо бы функцию написать, но я не буду)
        d[a[i][0]][0] += 1
        d[a[i][2]][0] += 1
        d[a[i][2]][1] += 1
        d[a[i][0]][3] += 1
        d[a[i][2]][4] += 3
    elif a[i][1] == a[i][3]:   #неплохо бы функцию написать, но я не буду)
        d[a[i][0]][0] += 1
        d[a[i][2]][0] += 1
        d[a[i][0]][2] += 1
        d[a[i][2]][2] += 1
        d[a[i][0]][4] += 1
        d[a[i][2]][4] += 1

for i, j in d.items():
    print('{0}:{1} {2} {3} {4} {5}'.format(i, j[0], j[1], j[2], j[3], j[4]))